src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьТаблицуРолей() Экспорт
		//@skip-warning
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		СписокПрав.Очистить();
		НаборПрав = Метаданные.Роли;
		
		//@skip-warning
		Для Каждого Роль Из НаборПрав Цикл
			
			//@skip-warning
			СтрокиРоли = СписокПрав.Добавить();
			СтрокиРоли.ИмяРоли = Роль.Имя;
			СтрокиРоли.ПредставлениеРоли = Роль.Синоним;
			СтрокиРоли.Включено = Пользователь.Роли.Содержит(Роль);
		КонецЦикла;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если (Пользователь = Неопределено) Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = ПолноеИмя;
	КонецЕсли;
	
	Пользователь.Роли.Очистить();
	
	СписокРолей = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	Для Каждого Роль Из СписокРолей Цикл
		Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.ИмяРоли));
	КонецЦикла;
	Пользователь.Записать();

КонецПроцедуры
